let a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2 - (ответ 2 будет, т.к. ++a тоже что и (a + 1);
d = b++; alert(d);           // 1 - (ответ 1 будет, т.к. при b++ будет сложение выполнено позже в отличии от записи ++b;
c = (2+ ++a); alert(c);      // 5 - (ответ 5 будет потому, что a у нас уже равно 2 и еще + 1, в итоге с = (2 + 3);
d = (2+ b++); alert(d);      // 4 - (ответ 4 будет, т.к. b выше у нас стало 2, а 3 оно станет потом. d = (2 + 2);
alert(a);                    // 3 - (ответ 3 будет, т.к. к a два раза уже прибавили 1 (++a);
alert(b);                    // 3 - (ответ 3 будет, т.к. к b два раза уже прибавили 1 (b++);